In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
data = pd.read_excel('titanic3.xls')
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [4]:
data= data.drop(['name','sibsp', 'parch', 'ticket','fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], axis=1)

In [5]:
data.head()

   pclass  survived     sex      age
0       1         1  female  29.0000
1       1         1    male   0.9167
2       1         0  female   2.0000
3       1         0    male  30.0000
4       1         0  female  25.0000

In [6]:
data['age'][0:10] < 18]

      pclass  survived     sex      age
1          1         1    male   0.9167
2          1         0  female   2.0000
53         1         0    male  17.0000
54         1         1    male  11.0000
55         1         1  female  14.0000
...      ...       ...     ...      ...
1265       3         0  female  10.0000
1275       3         0    male  16.0000
1279       3         0  female  14.0000
1300       3         1  female  15.0000
1304       3         0  female  14.5000

[154 rows x 4 columns]

In [13]:
data[data['age']< 18]['pclass'].value_counts()

3    106
2     33
1     15
Name: pclass, dtype: int64

In [14]:
data[data['age']< 18].groupby(['sex', 'pclass']).mean()

               survived        age
sex    pclass
female 1       0.875000  14.125000
       2       1.000000   8.273150
       3       0.543478   8.416667
male   1       0.857143   9.845243
       2       0.733333   6.222220
       3       0.233333   9.838888

In [15]:
data.iloc[0:2,0:2]

   pclass  survived
0       1         1
1       1         1

In [17]:
data.loc[0:2,['age','sex']]

       age     sex
0  29.0000  female
1   0.9167    male
2   2.0000  female

In [18]:
data.iloc[0:2, :]

   pclass  survived     sex      age
0       1         1  female  29.0000
1       1         1    male   0.9167